{"2":{"hero_id":"2","disp_name":"Armadon","description":"A stolid and stalwart defender of the weak, whether Man or Beast, the long-lived Armadon refused to take part in the war between the Legion and the Horde, and instead maintained a neutral haven amidst the strife.  With the arrival of the Hellbourne, however, Armadon&#039;s choice became clear, and he hefted his mighty mace in the service of good.  The gruff warrior is now a key hero in the New Legion.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"3":{"hero_id":"3","disp_name":"Behemoth","description":"Earth-shakers and wall-breakers, Behemoths march across the battlefield wielding uprooted trees with deadly force.  The sheer force of their attacks brings enemies to their knees, where powerful blows make short work of them. Of all the Beasts, none are so mighty as these noble creatures, nor any so willing to stand between the daemons and their friends.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"4":{"hero_id":"4","disp_name":"Chronos","description":"The greatest inventors of the Human Legion dreamed of making an army of machine warriors to spare humans the bloody cost of war.  Only one was ever created, for no one could ever find a way to quicken him.  When the Hellbourne fed a stolen soul into its mechanical shell, they brought the Chronos to life and gained the benefit of this artificial monster&#039;s mastery over time itself.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"5":{"hero_id":"5","disp_name":"Defiler","description":"Enshrouded with shadows and the echoes of damned souls, the Defiler is a lover of decay and madness and agony.  She draws strength from death around her, and can expel living, suffering shadows from her flesh.  Wielding both deadly attacks and an unholy awe that strikes silence into her foes, she truly deserves her vile epithet: &quot;Mistress of the Damned.&quot;","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"6":{"hero_id":"6","disp_name":"Devourer","description":"Consuming and destroying all in its path, the corpulent, putrid Devourer exists only to feed.  No pain can match the agony of its hunger, and so it shrugs off all attacks, spreading its rot and disease across the battlefield like doom itself.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"7":{"hero_id":"7","disp_name":"Blacksmith","description":"The smoke-blackened foundries of the Iron City have long been known to produce the endless stream of weapons and armor that make the Legion&#039;s war against the Hellbourne possible.  But now, as manpower becomes harder to replace than supplies, the very Blacksmiths themselves have joined the battlefield, bringing strength earned through decades of toil and a mastery over fire itself.","primaryattribute":"Intelligence","attacktype":"melee","team":"Legion"},"8":{"hero_id":"8","disp_name":"Slither","description":"The Serpent of the Seventh Pit, feeder on the sick and the weak, was summoned forth in the last days of the war between Man and Beast.  A cunning conniver and whisperer of false promises, Slither delights in suffering and despair.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"9":{"hero_id":"9","disp_name":"Electrician","description":"The finest Legion spies learned mere months ago of a mad archaeologist whose unnatural thirst for knowledge led him into a forbidden pact with the Hellbourne.  His discoveries have been used to forge Shocktroopers, men fused with Ancient technology, pulsing with violent energy.  These horrifying hybrids bear a tank of liquid lightning upon their backs, and they wield its contents as both sword and shield.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"10":{"hero_id":"10","disp_name":"Nymphora","description":"Nymphora has long been a protectress of Newerth&#039;s secret beauties, its secluded glades and crystal springs.  One might think that the paragon of butterflies and skylarks would have little role in the brutal carnage that has engulfed the world, but one need only see the tiny fangs revealed by her smile to know that she holds secret dangers of her own.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"12":{"hero_id":"12","disp_name":"Glacius","description":"The legends of Frostfield speak of a mighty warrior in a frozen prison who would break free when Newerth needed him most.  On the eve of the Hellbourne invasion, a man made more of cold than flesh emerged from the tundra.  Wrapped in mist and armored in ice, the stranger claimed the name Glacius, but when he aligned himself with the Hellbourne daemons, he shattered what hope his people had left.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"13":{"hero_id":"13","disp_name":"Hammerstorm","description":"Mighty and stoic, this famed warrior left behind the ruins of his home for a place in King Maliken&#039;s first Legion.  From boyhood on, he has known nothing but battle, and his silent determination and deadly strength have earned him the epithet &quot;Hammerstorm.&quot;  Every blow of his hammer resounds like a death knell across the battlefield.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"14":{"hero_id":"14","disp_name":"Night Hound","description":"Scurrilous rumors of unnatural parentage have haunted this proud, leonine warrior his entire life.  He long served in the Beast Horde as a shadowy scout and assassin before taking on a comparable role in the new Legion.  Wherever he came from, Night Hound is a welcome ally and a deadly foe.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"15":{"hero_id":"15","disp_name":"Swiftblade","description":"The unique armor worn by this mysterious warrior is said to have been uncovered in the ruins of an ancient city.  Whether the armor imbues the famed speed and pinpoint accuracy possessed by the warrior called Swiftblade, or whether he would be equally mighty without it, none can say.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"16":{"hero_id":"16","disp_name":"Blood Hunter","description":"Although the Hunters were members of the Beast Horde in its war against the humans, they always preferred the darkness to the light, and were won over to the Hellbourne with the promise of human blood.  They are led by the traitor Blood Hunter, a swift and deadly warrior who feeds on the blood of his enemies and heals with horrifying speed.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"17":{"hero_id":"17","disp_name":"Kraken","description":"A scourge upon the seas of Newerth, the Kraken consumed countless victims who were unfortunate enough to travel his waters. Though he be ashore, the Kraken brings the wrath of the ocean to the battlefield, dragging his enemies to depths unknown, unseen, and unwanted.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"18":{"hero_id":"18","disp_name":"Thunderbringer","description":"Unlike the wild lightning he commands, the Thunderbringer is marked by his calm patience and careful adherence to the ancient Beast protocols and etiquette.  Though considered a bit of a fogey by others, he is an undeniable master of shamanic lore and a powerful wielder of mystic energies.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"20":{"hero_id":"20","disp_name":"Moon Queen","description":"The insectoid Moon Warriors never entered into the great war between Man and Beast, but when the Hellbourne threatened Newerth, their very queen emerged to lead her people against the daemons.  With powers drawn from the moon and from the shared will of her hive, this strange creature is a mighty boon for the Legion.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"21":{"hero_id":"21","disp_name":"Pollywog Priest","description":"For centuries, every great Frog of the marsh peoples has wielded both political and magical power as the chief priest of the Wild Cults.  Called upon by his Beast brethren in this time of war, the Pollywog Priest has come forth to use those powers in defense of his people and Newerth itself.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"22":{"hero_id":"22","disp_name":"Pebbles","description":"The elemental creatures of Newerth have long kept away from mortal struggles, seeking instead to heal the destruction left in their wake.  In the current war, however, some elementals have taken arm against the daemons, and the huge and implacable Pebbles is one of them.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"24":{"hero_id":"24","disp_name":"Soulstealer","description":"The priests tell young men bound for the battlefield that if they fall, Elysian fields and peace awaits them.  But this is not strictly true, not as long as the Soulstealer walks the battlefield.  Gathering the spirits of those he kills in a bloody, shadowy sack, he augments his own power with their suffering.  Those who see him quake in terror to know that death, for them, will be no release, but only a fiery captivity and oblivion.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"25":{"hero_id":"25","disp_name":"Keeper of the Forest","description":"An ancient protector of the forest, the Keeper fights to save the lush lands of Newerth he has tended to his whole long life. Possessing a spiritual link to the trees, the Keeper has the ability to see what they see, be hidden amongst them, and even use them as brutal weapons to aid him in battle.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"26":{"hero_id":"26","disp_name":"The Dark Lady","description":"Wielding twin, scythe-like blades, the she-reaper known as the Dark Lady has moved through the Legion&#039;s ranks like a shadow of death.  For soldiers seeking to buck up their courage, she is a punch-line: &quot;Careful you don&#039;t find the Dark Lady,&quot; they joke to their carousing friend.  But even these jokes are accompanied by a shudder.  Swift and cold and lethal as the frozen winds off the steps, black as the cloud-choked night, she is no laughing matter.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"43":{"hero_id":"43","disp_name":"Demented Shaman","description":"No greater shame has the Beast Horde than the Demented Shaman: one of their holiest priests, an initiate into their deepest secrets and greatest lore, who betrayed his people and turned to join the Hellbourne.  He is a force of corruption and outrage, draining the life of the land to heal those who would destroy it and defeat those who would defend it.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"27":{"hero_id":"27","disp_name":"Voodoo Jester","description":"The Voodoo Jester haunts the dreams of countless warriors with his demented laughter, glowing eyes, and deadly magic.  It is said that every time a child weeps, his power grows stronger, though some believe this rumor was invented by parents to quiet their unruly children.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"29":{"hero_id":"29","disp_name":"War Beast","description":"Once a hound keeper in the underworld, War Beast heeded the call to arms in order to feed the victims of Newerth to his pets. War Beast&#039;s allegiance was never questioned. His hunger for carnage remains unending, feeding the animal within.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"30":{"hero_id":"30","disp_name":"Wildsoul","description":"Is the mighty Wildsoul a Beast who dreamed himself a Man, or a Man who dreamed himself a Beast?  As much a bear as a human, this druidic warrior draws upon primordial woodland energies to strengthen himself and crush those who threaten the natural life of Newerth.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"227":{"hero_id":"227","disp_name":"Pearl","description":"For eons, the Bubble Magi were the greatest defense the Legion had against the Beasts and Demons. Their protective magic circled the Legion cities in domes that kept the enemy assaults at bay. When Maliken betrayed the Legion, his agents simultaneously assassinated every Bubble Mage known to the Legion and burned their monasteries to the ground. All of them... save for one lone apprentice who was mistaken for a mere servant and one pet turtle who had watched his master from afar. Searching among the ruins of her home, she discovered her master&#039;s staff still clutched in his charred hands. As she took up his weapon, she finally allowed her tears to flow and her determination became clear. She has spent years honing her craft and now Pearl, the last known Bubble Mage, has taken to the battlefields to bring vengeance down upon Maliken and his demon horde.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"31":{"hero_id":"31","disp_name":"Zephyr","description":"A riddler, a sage, and a lover of sweets, Zephyr sadly is known in these times simply as a warrior of the winds.  Though he chose not to participate in the Beast Horde&#039;s war with the humans, he has joined battle against the Hellbourne, and the powerful winds and aerial attacks he calls down upon the daemons are a welcome addition to the new Legion.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"34":{"hero_id":"34","disp_name":"Pharaoh","description":"The Hellbourne unearthed this creature from the shifting sands of the Great Waste.  He could originally speak but a single word, which has become his name -- Pharaoh.  It seems he must once have been a mighty king, wrapped as he is in golden finery, but now he is simply a monster, summoning forth his dead servants from the grave and conjuring fire and fear across the land.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"35":{"hero_id":"35","disp_name":"Tempest","description":"Spirits born of the elements, Tempests howl across the land raining fire and ice alike, indeed even calling great meteors from the heavens.  Summoned of old by the Beast Horde, these ethereal beings now are summoners themselves, bringing elementals and even shadows of themselves onto the battlefield.  Even their allies view these strange beings with awe bordering on fear.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"36":{"hero_id":"36","disp_name":"Ophelia","description":"Few are those who do not know of Ophelia, Queen of the Beast Horde and sister to Jeraziah. Though numerous are her talents, she is most revered for her innate ability to commune with all things natural. Both a warrior and a leader, Ophelia wields these powers over nature to serve the Legion by healing allies and recruiting the wild denizens of Newerth to their cause.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"165":{"hero_id":"165","disp_name":"Moraxus","description":"Leaving a trail of headless and maimed corpses in his wake, the blade-throwing Moraxus is among the most feared of the Hellbourne daemons. Some speculate he was once a Beast, transformed by sheer agony in the pits of hell. Others claim he is an elemental creature of warfare itself. Whatever his origin, Moraxus is an unstoppable, implacable foe.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"37":{"hero_id":"37","disp_name":"Magebane","description":"A keeper of lost lore and a priest to forgotten gods, Magebane invokes unholy rituals to drain the energy of his enemies and turn it back against them.  In less desperate times, heretics such as Magebane would have been burned at the stake, but this is not the first unexpected clemency brought about by the war against the Hellbourne.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"38":{"hero_id":"38","disp_name":"Legionnaire","description":"Legionnaires, the namesakes of the Legion itself, bring unflinching power to the battlefield.  With their massive battle-axes, these warriors spread carnage among their foes and cleave bloody swaths through enemy ranks.  Even those daemons born of fear itself can be terrified by these heroes of the Legion.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"39":{"hero_id":"39","disp_name":"Predator","description":"With huge, lance-like claws of solid bone emerging from their forearms, and spikes fit to impale the strongest foe spread across their hard shell, Predators seem more like daemons than Beasts. The men who fight beside them look at them with recollected fear from the days the Predators hunted humans, not daemons.  But the hunger, speed, and rage they bring to bear against the Hellbourne are a welcome boon.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"40":{"hero_id":"40","disp_name":"Accursed","description":"Many have speculated as to what great, damned warrior now lives in torment within the burning armor that marches alongside the Hellbourne army. The Accursed, as he is known, screams in agony as he brings fiery devastation to his foes, but his actions seem driven more by a desire to find oblivion than by malice.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"41":{"hero_id":"41","disp_name":"Nomad","description":"The battle-hardened hunter of a hundred clashes first appeared on a dusky eve, a lone messenger and executioner to the Legion from vast desert wastes. Rumored to serve no one, and not unlike the very Sand Wraith he hunts, the Nomad&#039;s stern and offsetting demeanor has yet to gain him the trust of Legion soldiers. Nonetheless, his eagle-like reflexes and the swiftness with which he swings his gargantuan blade have made believers of heathens yet.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"42":{"hero_id":"42","disp_name":"The Madman","description":"No one knows for certain the identity of this masked and demented murderer.  Some say he was confined for eons in the deepest pit of Hell, a villain so black at heart that even the Hellbourne treated him as a pariah, yet so deadly that they were forced to call upon him in their war with the Legion.  Others say he is a man, just a man, but driven mad by the endless carnage he has witnessed.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"44":{"hero_id":"44","disp_name":"Scout","description":"Trained since youth to be swift, silent, and deadly, Scouts spend much of their lives deep in the wild, apart from their brethren.  After the alliance with the Beast Horde, they learned yet more ways of the wild, and turned all their craft to defeating the Hellbourne.  Though many view them as aloof, none doubt the importance of Scouts in the war against the daemons, as the countless enemy corpses, dead by a single blow, attest.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"94":{"hero_id":"94","disp_name":"Pyromancer","description":"For centuries, the Sacred Order has recognized the &quot;Flame-Touched,&quot; those men and women filled with a burning, if more than slightly mad, devotion to Sol.  Those Flame-Touched who serve in the Legion are more commonly called Pyromancers for their mastery over fire, and creatures strongly attuned to that element.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"91":{"hero_id":"91","disp_name":"Puppet Master","description":"Although all the daemons of the Hellbourne ranks are terrifying, few deserve to be called &quot;creepy.&quot;  Yet that is the best word for the Puppet Master, whose smirks and gibbers and cackles of glee bespeak not just the specter of death, but something worse.  His puppets are offenses to life -- either false things imbued with stolen life, or living things twisted to his will.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"95":{"hero_id":"95","disp_name":"Pestilence","description":"Once a councilor to the Moon Queen, Pestilence betrayed his people -- for as a male, he could never have come to rule them himself.  With his own powers augmented by the Hellbourne, he is as strong as the queen he served in the past.  But his arts are unholy: mindless, ravenous insects he calls forth, cruel and violent skills he deploys.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"96":{"hero_id":"96","disp_name":"Maliken","description":"Once the greatest defender of mankind and lord over the entire Legion, Maliken walked too close to the darkness and was claimed by it.  Now he is nothing more than a slave among the damned -- but his incredible might has only grown in his downfall.  Wielding a damned sword fed by his own damned soul, Maliken is the bane of the very heroes he once led into battle.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"92":{"hero_id":"92","disp_name":"Arachna","description":"It is said that for every fear and phobia that afflicts Man and Beast alike, there is a daemon waiting to be born.  Arachna -- chittering, skulking, crooked and wicked -- spawns from the fear of spiders.  Protected by a chitinous exoskeleton as strong as cold iron, she stalks, and traps, and slaughters her enemies.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"93":{"hero_id":"93","disp_name":"Hellbringer","description":"During the war against the Beasts, many humans became experts in summoning daemons to fight alongside the Legion.  Some became addicted to this unholy act, and even when the Hellbourne turned against their masters, continued to invoke the dark rituals.  One such warlock is known only as Hellbringer, now a captain in the Hellbourne army and perhaps the most despised man on Newerth.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"90":{"hero_id":"90","disp_name":"Torturer","description":"Many years ago, the Torturer was just a dying man who made a pact to serve the Hellbourne in exchange for eternal life. However, to ensure his loyalty without the distraction of physical temptations, the Hellbourne stripped the man of his physical body leaving the pure energy of destruction, agony, and hate.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"89":{"hero_id":"89","disp_name":"Jeraziah","description":"King Jeraziah, the hope of humanity and one of the two leaders of the new Legion, is not just a mighty warrior but also the chosen of Sol himself.  Charged with divine fervor and favor, he rallies his men and wreaks havoc among the daemons.  The light that shines forth from him leads all toward victory, and represents the dawning of a new day, one without cloud or shadow.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"102":{"hero_id":"102","disp_name":"Andromeda","description":"The star-born celestial known as Andromeda is a stranger to Newerth.  With no memory of her home or her people, she is driven merely by an innate sense that the Hellbourne are vile and the mortal inhabitants of Newerth innocent.  Her powerful dimensional magic allows her to bring destruction to the daemons or strength to her new-found allies.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"103":{"hero_id":"103","disp_name":"Valkyrie","description":"The ancient sagas of the heathen north have long told to the tale of the battle-women known as Valkyries.  For centuries, their ranks have thinned as the old ways have died out and civilization stretched its smothering hand over the frozen wilds.  But some Valkyries still remain, cold and swift as the north wind, wielding their lances with expertise to rival the most veteran Legion warriors.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"104":{"hero_id":"104","disp_name":"Wretched Hag","description":"The Wretched Hag haunted Newerth&#039;s darkness long before the Hellbourne spilled forth.  A fiendish hag fatted off the flesh of children and virgin brides, she keeps as her only company a swarm of bats -- the only creatures that can abide her shrieking cries.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"105":{"hero_id":"105","disp_name":"Succubus","description":"Many a soldier of the Legion has disappeared on solitary watches when the Succubus is at large, lured in by her seductive calls.  Swollen with stolen life, this daemon offers no true pleasure to those who succumb to her advances, but all the same her name carries a certain terrible allure.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"106":{"hero_id":"106","disp_name":"Magmus","description":"The primordial and elemental creature known as Magmus is no demon, though he fights alongside the Hellbourne.  Rather, he was drawn forth from the earth, as evil calls to evil and separate flames join to form an inferno.  A holdover from an ancient, cataclysmic age of fire, Magmus dreams of returning Newerth to ash, lava, and cinder, and he wields his considerable might and magic in that terrible cause.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"108":{"hero_id":"108","disp_name":"Plague Rider","description":"The pestilential stench of the Plague Rider can be smelled for miles, a foul warning of the diseases following in its wake.  Mounted atop his undead steed, carried aloft on a stinking cloud of flies, the Plague Rider sows sickness among friends and enemies alike, all with the end of spreading disease across the lands of Newerth.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"109":{"hero_id":"109","disp_name":"Soul Reaper","description":"The Soul Reaper is born in the depths of Hell itself and has risen to the surface on a mission to capture the souls of Newerth. With the authority to instantly judge those he comes in contact with, even the strongest of the Legion wither when he approaches.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"110":{"hero_id":"110","disp_name":"Pandamonium","description":"The last of a race of warrior-monks sworn to a chaste existence in the misty Sang-La mountains, Pandamonium has left his bamboo groves for the battlefield.  He moves with a grace that belies his great stature and strikes with fury surprising in one with such an apparently gentle nature.  And though he is a creature of few words, the Beasts put great stock in his wisdom.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"115":{"hero_id":"115","disp_name":"Vindicator","description":"From one generation to the next, a reclusive order of hermits have guarded apocryphal writings said to come from the Prophet himself.  Vindicator, still early in his lonely quest, is the last of these lonely sentinels, but he has left his exile behind in order to join the battle against the Hellbourne.  Using the potent verses inscribed in the Great Book, he wields unique and powerful magic.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"114":{"hero_id":"114","disp_name":"Corrupted Disciple","description":"Having traded Sol&#039;s sacred flame for the potent and unholy energy of the Hellbourne, the Corrupted Disciple is now little more than a battery of black magic.  He unleashes this fell sorcery in many forms, some to his benefit but all to the agony of those around him.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"116":{"hero_id":"116","disp_name":"Sand Wraith","description":"Legends long said that when the sirocco howls off the Great Waste, it is screaming of a Sand Wraith.  In the past years, the legend has been borne out, as this ancient evil has glided through Newerth, leaving curses, confusion, and despair in his dusty wake.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"117":{"hero_id":"117","disp_name":"Rampage","description":"A ranger of the vast plains of Seradati, Rampage has captured in his human form the strength of the Beasts.  Atop his mighty rhino Horatio, Rampage smashes through enemy lines and moves at times with unnerving speed.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"120":{"hero_id":"120","disp_name":"Witch Slayer","description":"No city is more pious in its worship of Sol than Arasunia, and no man is more fervent among its zealous citizens than the Witch Slayer.  Although he is viewed with uncertainty by the Beast shamans and human sorcerers in the Legion, his combat prowess and holy powers make him a mighty ally.  Wielding a musket and a bladed icon of Sol, he not only can hold his own in battle, but also can sap his enemy&#039;s strength and turn any ground into sacred territory.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"121":{"hero_id":"121","disp_name":"Forsaken Archer","description":"Once a woodland huntress who captured the hearts of countless men, the Forsaken Archer was taken against her will and slain by a spurned suitor.  As she lay dying she forged a terrible pact with the daemons who discovered her broken body.  Now, rather than hearts it is souls she captures, wielding them as weapons.  Atop the skeletal remains of a beast she once hunted, the forsaken archer rains terror upon any who stand in her path.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"122":{"hero_id":"122","disp_name":"Engineer","description":"The Engineer is a man driven by more than mere eccentricity.  Once a humble, hard-drinking builder in the Legion, he came to master all manner of machines.  Wielding a blunderbuss of his own design and hoisting ale and a veritable armory on his back, he is a strange but impressive sight on the battlefield.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"123":{"hero_id":"123","disp_name":"Deadwood","description":"Born of the cruelly tainted lands of Newerth, Deadwood is the undead husk of the first Keeper of the Forest.  All around him, living things wilt, and he has little hesitation to destroy trees or use them as weapons.  Despite seeking the destruction of Newerth, he still commands the incredible strength and natural powers of a forest guardian, thus combining the cruelty of the Hellbourne with the powers that once belonged only to the Beast Horde.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"124":{"hero_id":"124","disp_name":"The Chipper","description":"The elusive chiprel race has spent countless years avoiding conflict, but the Hellbourne are not a threat easily ignored.  The Chipper has taken action, piloting an advanced tactical combat and acorn collection machine.  Armed with missiles, tar dispensers, and deployable saw blades, The Chipper is ready for war.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"125":{"hero_id":"125","disp_name":"Bubbles","description":"A powerful wizard once owned a pet turtle.  Each day, the turtle watched and mimicked as the wizard practiced his spells.  One day, the turtle fell into a magical pool and was transformed into more than a mere turtle. Now, centuries after his master died, Bubbles lives on, fighting the forces of evil.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"126":{"hero_id":"126","disp_name":"Fayde","description":"A shadow cast by the evil in the hearts of Man and Beast alike, Fayde lurks in the dark places of Newerth.  While her scythe-like claws are terrible enough, it is her ability to call forth new shadows of herself--or her foes--that is most awful of all.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"127":{"hero_id":"127","disp_name":"Balphagore","description":"Balphagore&#039;s gluttonous love of corpses draws him to wherever the Hellbourne&#039;s atrocities are at their worst.  Armed with an array of dark powers, this daemon is not to be trifled with when hungry -- and Balphagore is always hungry.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"128":{"hero_id":"128","disp_name":"Gauntlet","description":"Nedd the ogre was captured by the Hellbourne when their war with the legion overran his home.  The Hellbourne used their demonic magic to alter Nedd, fusing him with powerful weapons, and lobotomizing him to ensure complete obedience. Now little remains of the peaceful ogre he once was. He&#039;s an abomination, a living weapon, a tightly-reined destructive force: He is Gauntlet.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"160":{"hero_id":"160","disp_name":"Tundra","description":"From the ice-caverns of the Frostfield hails Tundra, a white ape shaman of enormous size and power. His thundering voice commands the obedience of wild creatures and his magical powers conjure up the terrible cold of his northern home. Even fiery Hellbourne daemons feel a chill as he enters the fray.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"161":{"hero_id":"161","disp_name":"The Gladiator","description":"Although trial by combat was long ago outlawed in the Legion of Man, on the fringes of civilization there are several who still practice it. When the war between the Legion and the Hellbourne broke out The Gladiator ventured forth in search of worthy opponents, each crack of his mighty whip sounding the death knell for another daemon.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"162":{"hero_id":"162","disp_name":"Doctor Repulsor","description":"The storied professor of archaeology had never been content. The earth was full of artifacts; artifacts that held secrets to the prior lives of men. Science, psychology, sociology... the forgotten vices of man and the primal tenets of the Hellbourne, poured into the professor as he absorbed the forbidden knowledge and was consumed. Devoid of free will, he is now a slave to the power he once coveted.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"170":{"hero_id":"170","disp_name":"Tremble","description":"Hellbourne corruption has spread across Newerth--and deep into it as well. From beneath the crusted depths emerges the carapaced undying horror that is Tremble, awakened to wreak havoc upon the Legion forces. Mysterious terrain deformations seem to herald his arrival, while a trail of corpses marks his path of departure.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"163":{"hero_id":"163","disp_name":"Flint Beastwood","description":"For years, the Beasts told of a twisted man-thing that stalked them through the Rulian marshes, leaving a trail of corpses in his wake.  The humans dubbed him &quot;Flint Beastwood&quot; -- playing on his flint-lock firearms and his residence in the Beasts&#039; forests.  Fast to draw, fast to kill, fast to laugh about the deed, Flint has now spread his carnage beyond the marshes to wherever he can find the Legion.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"164":{"hero_id":"164","disp_name":"Bombardier","description":"Brother of the famed evil scientist that became Dr. Repulsor, the Bombardier uses his wild mind to aid the Legion. Just a few years ago, the two brothers made amazing technical wonders together. But the Hellbourne arose and corrupted Repulsor, leaving the Bombardier with a fierce sense of vengeance. Bombardier, along with faithful assistant Twitch, uses his various inventions and dangerous toys to beat the Hellbourne back into hell so far that they will finally release their evil grip on his brother.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"166":{"hero_id":"166","disp_name":"Myrmidon","description":"Myrmidon&#039;s allegiance to the Legion was always tenuous at best; the sharkman&#039;s joy in the carnage of combat left many suspicious.  It was not until a Legion sorcerer uncovered that Myrmidon was himself a member of a shadowy race of deep-sea daemons that true panic set in, but by then it was too late.  A trail of blood and devastation marked Myrmidon&#039;s escape to the ranks of the Hellbourne.  Now, wielding the destructive might of a tsunami, he wreaks havoc among those who once claimed him as an ally.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"167":{"hero_id":"167","disp_name":"Dampeer","description":"In the darkest days of the war, when starvation stalked the land, it is said that some men turned to eating the flesh of the dead -- and then, the flesh of the living. Perhaps that is the origin of Dampeer, a monster who feeds on the lifeforce of his foes, spreading terror before his tattered wings, his pants the only remnants of his humanity.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"168":{"hero_id":"168","disp_name":"Empath","description":"Tied to the lifeforce of all creatures that move across the lands of Newerth, the Empath has suffered greatly in the war against the daemons. Nevertheless, her gift -- and curse -- is a powerful asset for the Legion, for the Empath is able to call on her magic to heal allies, weaken foes, and even merge her essence with other heroes.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"169":{"hero_id":"169","disp_name":"Aluna","description":"Beautiful and spirited, Aluna carries within her the essence of Earth itself -- the old Earth, long since lost to the decay of ages. Endowed with its might, and carrying the power of the moon in a mystical emerald, Aluna strikes at her daemonic foes with deadly speed. Thanks to her skill in battle, she has already become a celebrity among the heroes of Newerth.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"185":{"hero_id":"185","disp_name":"Silhouette","description":"An orphaned child, Silhouette trained in the Hidden Village of the Scout, working hard towards her goal to become the greatest assassin in Newerth. Unlike her fellow scouts, she was loud, boisterous, and most of all, simply not stealthy. Yet what she lacked in subtlety was made up for with heart, attitude, and the ability to conjure a perfect mirror image of herself. Believe it!","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"187":{"hero_id":"187","disp_name":"Flux","description":"The legionnaire spent years entrapped within the earth, tortured by his captors. Thrashed about by gravity itself, he became infused with its strength. Slowly he built himself a suit of the hardest metals known to man, tempering away for years as he honed its infernal machinery in secret. As he soldered the final plate onto himself, he emerged neither man nor machine, but a force of nature itself.","primaryattribute":"Strength","attacktype":"ranged","team":"Legion"},"188":{"hero_id":"188","disp_name":"Martyr","description":"Few clergy of Sol burn with such brilliance that they may ascend to the highest orders of priesthood. Even fewer dare gift their own souls to the Legion, braving an eternity in damnation so that others may prosper in turn. The few who do earn the forsaken title of the Martyr, wielding a battle-ready relic in one hand and carrying the Codex Solaris in the other. To certain death they march; and some say, with more fervor than those who march towards life.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"192":{"hero_id":"192","disp_name":" \t\tAmun-Ra","description":"The corrupted disciples of Sol harnessed the errant energies of the sun, and from that culmination of twisted nether emerged the ancient daemon god Amun-Ra, abomination of all that is light and holy. Fused together by black fire and fury, this immortal construct threatens to raze the lands with every burning step, defiling everything he touches with heretical fervor.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"194":{"hero_id":"194","disp_name":"Parasite","description":"While the world above burned, within the deepest crevices of Newerth an abominable conglomeration of sentient gels, pathogens, and other lurkers of the deep simmered in a primordial pool, slowly evolving and multiplying. From this cesspool emerged the Parasite, sickeningly intelligent and chaotically evil.","primaryattribute":"Intelligence","attacktype":"melee","team":"Hellbourne"},"195":{"hero_id":"195","disp_name":"Emerald Warden","description":"From a lost scout&#039;s journal: This visage of a great horned beast, imposing in stature and ornately bejeweled, descends to us a representative of an unknown druidic sect of beasts. At his behest lesser creatures of the forest fall under command, and when his bow is raised a foe shall fall.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"196":{"hero_id":"196","disp_name":"Revenant","description":"Risen from the souls of the fallen and forgotten, the revenant courses through battle a fiery remembrance of the ill fate that the damned of war are destined to fulfill. Soldiers and sorcerers alike cringe at the revenant&#039;s silent howl, a savage memory of battles past. Those who look into its empty gaze will find nothing but oblivion.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"197":{"hero_id":"197","disp_name":"Monkey King","description":"Borne of bestial nobility and blessed with the gift of immortality from the fruit of the Sefir Tree, the Monkey King once wrought a burning trail of havoc that stretched from the mortal plane to the heavens before he was imprisoned for his actions. In an act of repentance, he earned his freedom by accepting the tutelage of Ophelia, who seared onto his forehead a golden seal to control his primal urges. Bound to his new mistress, the Monkey King begins his great journey with renewed strength and zeal.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"201":{"hero_id":"201","disp_name":"Drunken Master","description":"For the Drunken Master, there exists only a single cardinal rule: that booze shall flow, freely and indefinitely. At first apathetic to the Hellbourne threat, the Drunken Master leapt to action when a wise sage explained to him that should the Hellbourne overrrun Newerth, there would be no more booze. Armed with expert combat techniques and fueled by questionable substances, the Drunken Master embodies that which is unpredictable and unyielding.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"202":{"hero_id":"202","disp_name":"Master Of Arms","description":"Efficient and deadly, the Master of Arms dispatches his foes with blazing speed and pinpoint accuracy. With an arsenal rivaled by none he spreads chaos among his enemies while rallying his allies with his lust for battle.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"203":{"hero_id":"203","disp_name":"Rhapsody","description":"A long, long time ago, I can still remember how that Rhapsody came to join the Legion. She knew if she had her chance, she could make the Malphas sing and dance, and maybe it would stop killing her fans. But then she ran into Slither, who poisoned her fans there and hither, she could no longer bear it, so she did so swear it. She pledged her life to the Legion cause, took Jeraziah as her boss, who consoled Rhapsody for her loss, and vowed to be at her side.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"204":{"hero_id":"204","disp_name":"Geomancer","description":"As you rest your head on your pillow at night, you can&#039;t help but notice a dark shape in the corner of the ceiling. You look closely at it, but you can&#039;t make out what it is. In the morning, you see that it&#039;s gone. Yet the next night, it returns.","primaryattribute":"Intelligence","attacktype":"melee","team":"Hellbourne"},"205":{"hero_id":"205","disp_name":"Midas","description":"The tale of Auric of the deserts is perhaps a shrewd allegory to the fall of man. A wise and knowledgeable researcher, he had devoted his life&#039;s work to perfecting the ancient art of alchemy. However, upon discovering the vaunted power of transmutation, his lust for knowledge turned to greed, and within the span of a few mad days all around him was transformed to gold. Realizing what he had done, he gave an anguished cry and set out to atone for his sins.","primaryattribute":"Strength","attacktype":"ranged","team":"Legion"},"206":{"hero_id":"206","disp_name":"Cthulhuphant","description":"Lost beneath the depths of the darkest sea, a dead behemoth dreamt a nightmare of unfathomable evil. Infused by the primal energies of the earth, his dream took to reality as a living omen to insanity, trodding out of the ocean floor and onto land.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"207":{"hero_id":"207","disp_name":"Monarch","description":"Whereas the Moon Queen ruled over the night, the Monarch held dominion over day. And when her kin brought themselves into the fight against the Hellbourne, the Monarch herself pledged her hand to the cause.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"208":{"hero_id":"208","disp_name":"Gemini","description":"While fire and ice are typically conflicting elements which negate each other, they are harnessed as one in Gemini. A powerful elemental creature bathed in frost and ember, Gemini confuses foes as contradiction incarnate. Few know - and yet fewer understand - Gemini&#039;s origins, but it has been rumored that he is actually a fusion of two separate entities.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"209":{"hero_id":"209","disp_name":"Lord Salforis","description":"Lord Salforis, Baron of Blackwal, commands necromantic powers that distinguish him from typical Hellbourne fodder. A potent sorcerer and general alike, his mere presence on the battlefield is enough to induce visions of fear in his foes, rotting them from the inside and draining their souls. Rumor has it that falling to his lance will doom one&#039;s soul.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"210":{"hero_id":"210","disp_name":"Shadowblade","description":"Only whispered of by those who dare to speak its name aloud. A blade forged by the daemons themselves in the pits of the abyss and tempered in the still-beating hearts of their enemies. Its tainted magic ensured that no one slain by the blade will ever find refuge in the light of Sol or the branches of the Tree of Life. Instead they will find themselves forever bound within its cold metal prison and giving shape to its infernal form. It is the Shadowblade, drinker of souls.","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"215":{"hero_id":"215","disp_name":"Kinesis","description":"The Prophet teaches that energy flows through all things, we must only harness it for ourselves. The mages invoke incantations, the priests call upon gods wicked and just, but for the truly powerful, the power is harnessed from within. These are the Disciples of the Way and among them there is one known for his mastery over all - Kinesis. Let the Hellbourne beware the power of his mind.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"211":{"hero_id":"211","disp_name":"Artesia","description":"There was once a sorcerer and sorceress, kindreds spirits that would not be separated by mortal means, and so the fates would dictate that the immortal hand of death would grasp for one and leave the other be. Her lover gone, she remains lost in reverie, forever haunted yet blessed with his presence, yearning to reach into the very depths of hell to retrieve his soul.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"212":{"hero_id":"212","disp_name":"Gravekeeper","description":"On the battlefields of Newerth, rich in the tainted blood of man, beast, and demon, an ancient evil grows. Consuming the flesh from the fallen he claws his way to the surface, his once dead eyes alive again with hunger and eager to consume the dead. Especially those created by his own undead hands...","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"213":{"hero_id":"213","disp_name":"Berzerker","description":"When news of the war in Newerth reached the Berzerker, he hastily left his frozen homeland in the North. Though he holds no allegiance to the Legion, the chance to face hell&#039;s demons is one the Berzerker could not pass up. An incredible warrior with an indomitable will, the Berzerker&#039;s reckless disregard for his own life gives him strength and power seemingly beyond measure, albeit at a risk. Once he has steeled himself, only death will stop him from killing his foes.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"214":{"hero_id":"214","disp_name":"Draconis","description":"The ancient guardian arose, stirred from his centuries of slumber by the cries of help from its creator - the Worldtree. He slowly shook the treasure loose from his scales and took flight - The Demons would soon find that even they could burn in the flames of Draconis, the Great Wyrm.","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"217":{"hero_id":"217","disp_name":"Blitz","description":"Among the Beast Tribes of Newerth a Great Race is held in the savannahs each year. The winner joins their Queen in the battle against the Hellbourne. Many types of warriors compete, some rely on strength, some stealth, and others use speed and cunning. The Grand Champion is the vulpinoid master of velocity - Blitz! Now the Hellbourne daemons must hide to survive, for they certainly cannot run!","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"219":{"hero_id":"219","disp_name":"Ellonia","description":"Those who hail from the great Frostfields of the north live by one rule: fight or die. But now, the Hellbourne forces are rapidly advancing towards their beloved homelands and demolishing everything in their path. The powerful ruler of those harsh lands knew her lands would be next and could not sit idly by while her kingdom fell. Thus, the only sorceress deserving of the name Frost Queen fights not to defend the Legion but to bring forth the full might of winter and banish the daemons back to the pit from which they crawled.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Legion"},"216":{"hero_id":"216","disp_name":"Gunblade","description":"All he had known, all he had loved-- killed by the wild beasts. He could hear his own screams echoing in his ears as he dropped to his knees and drew his blade. Driven by madness, he began to carve a cursed symbol into his own flesh. Pain was forgotten and only revenge filled his mind. Soon, the symbol was complete and, bathed in his own rage-filled blood, a bargain was struck. The warrior&#039;s wish would be granted. He would be given the power that he so desired and the opportunity to exact his revenge. The now-cursed warrior was given two hell-forged firearms and was reborn as Gunblade, Hell&#039;s Ranger. Once a Lawman, now the Sheriff of the Damned.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"218":{"hero_id":"218","disp_name":"Artillery","description":"He looked down at the gear that the Engineer had salvaged from the dig. It was amazing how much destructive power the Ancients could pack into something so small. He oiled the barrels of the gun, loaded the rockets in their launchers and strapped them down to his back. He lit his cigar and strode towards the battlefield. Let those demons have their electricians - they don&#039;t stand a chance against this new breed of soldiers raining death from above - Artillery!","primaryattribute":"Agility","attacktype":"ranged","team":"Legion"},"220":{"hero_id":"220","disp_name":"Riftwalker","description":"Manipulator of the forbidden arts, she reaches into the realms of the ancient evils. She seeks to discover more secrets that the Legion has forgotten, lest the Elder Gods awaken. Tapping into the darkness, she draws forth unholy power to aid the hordes of her liege. Do not let her pleasant demeanor fool you. The Riftwalker fears nothing and will serve only those who will aid her mad quest for power.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"221":{"hero_id":"221","disp_name":"Bramble","description":"When the war spread from the northlands into the jungles of Newerth, both man and Deamon discovered why the natives call the land Death&#039;s Cradle. Creatures warped from the chaos of the past abide in these forbidden lands, where beasts are prey and plants are predator. Deep in these jungles, the Keeper found the eldest of the mantraps and fed it the blood of the corrupted - Deamons and the fallen. Filled with their dark power, Bramble now stalks her chosen meals across the battlefields, helping destroy the enemies of the Keeper...","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"222":{"hero_id":"222","disp_name":"Ravenor","description":"The souls of the damned suffer eternal torments in the hells ruled over by the Daemon Lords. The administration of such torments are left in the hands of the cruelest and most sadistic of all the condemned. These irredeemable souls take such delight in the torture of others that they are imbued with the purest essences of anger, cruelty, and hate. These beings earn a title that strikes fear into both the living, and the dead; they are the reapers of souls, the crushers of dreams, the bastions of terror, and the delivers of the damned. They are Ravenors, and their Lord is known by that title alone.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"223":{"hero_id":"223","disp_name":"Prophet","description":"There are those who take a different path to power, one of pacts and binding. These are not the infernal pacts of the Deamons, but instead they are made with the forces that oppose the chaos the Hellbourne bring. The creatures of the world and the forces of life, death, and nature themselves all wish to have their say in the fate of Newerth. To ensure the Hellbourne are driven back into the pits from which they spawned, each will empower an avatar to fight on their behalf, a Prophet to ensure that fate favors the bold. Although the pacts started out as noble, the Prophet did not realize that Raven is a trickster and his pacts come at a cost. The power that the Prophet wielded was more than any one man should taste, and soon he craved more. The only way to achieve such levels of power was the sacrifice of others and when the Legion discovered this wickedness, the Prophet was marked for retribution. He escaped to join the ranks of the Hellbourne where his prophecies can be cast without regard for life or morality.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"224":{"hero_id":"224","disp_name":"Rally","description":"In the armies of men and beast most soldiers are brave and true. They are loyal and follow the orders of the men who command them. But among the armies there must be leaders of men, generals to whom all others wills bend and heads bow. These are the men and women who take command of the forces that defend Newerth from the Hellbourne horde. They give new meaning to the word hero and all men come to their call - RALLY!","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"228":{"hero_id":"228","disp_name":"Grinex","description":"For many years, stories have been told in Newerth of a place where unimaginable creatures live in perpetual darkness known as the Great Rift. Many on Newerth have attempted to commune with this place of power and Valreia the Riftwalker is one of the few who is known to have succeeded. Since the Hellbourne enlisted her help in the war against the Legion, rifts have been opening in various parts of Newerth and a great creature has made its way through. Even in the darkness of the Great Rift, there&#039;s terror and this creature known only as Grinex is the embodiment of fear. Trapped in a strange new world, this evil power seeks the Riftwalker, as she represents his only chance to escape from this wretched land. Using the Great Rift&#039;s power should not be taken lightly and this mere human has grown arrogant. Her time grows short as Grinex approaches from the shadows!","primaryattribute":"Agility","attacktype":"melee","team":"Hellbourne"},"225":{"hero_id":"225","disp_name":"Oogie","description":"Hidden in the forests of Newerth are the secrets to great power. When one communes directly with the trees and plants of the world it is possible to tap into the roots of the Worldtree itself, and in those ancient veins of life are the great memories of primordial power that promise its wielders control over the elements themselves. This power is never without a price or a transformation.","primaryattribute":"Intelligence","attacktype":"melee","team":"Legion"},"226":{"hero_id":"226","disp_name":"Solstice","description":"Among the tribes of the moon, there lives an elite caste of warriors. Like Krixi, the Moon Queen, these women draw their power from the rays of Lunari. As children of the Moon Goddess, the rays of Sol burn their flesh, forcing them to construct a vessel to channel Lunari&#039;s might during the day. The magicks used were so potent that only a chosen warrior, born in perfect balance between light and darkness, could harness its vast power by being forever bonded to her armor. In the night, the chosen can retake her true form and strike from the shadows, free from her confining shell. Be it through strength by day or stealth by night, Solstice, the Lady of Lunari, stands ready to show her enemies what power truly is.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"229":{"hero_id":"229","disp_name":"Lodestone","description":"Dr. Repulsor stood back and looked over the creation in his laboratory. The golem made from magnetized stone and steel was complete and ready to be brought to life. He watched as Hellbringer completed the ritual to summon forth the demon that would power the construct and bring it to life. The Eldritch runes etched into its frame would hold the creature eternally in place. While it may lack the intelligence of Chronos, the new soldier would be the first of many demon powered war machines.","primaryattribute":"Strength","attacktype":"melee","team":"Hellbourne"},"230":{"hero_id":"230","disp_name":"Bushwack","description":"In the northeast reaches of the Rulian Marsh exist a tribe that have fought hard for a place to call their own. However there are those who leave the marsh, sometimes by choice, but most times by force. Bushwack is a hunter that has been living on his own for years. Ostracized from his tribe at a young age for tampering with the technology of an abandoned Dwarven village. Considered to be bad voodoo by the tribal elders, such interactions with the strange machinery was not only forbidden but punishable by exile. Bushwack pleaded with the elders saying that it is foolish to not use the power of one of their greatest foes, but his pleas fell on deaf ears. So he parted ways with his people in order to pursue his passions.  Now he is one of the most feared hunters of the southern parts of Death&#039;s Cradle, using his troll cunning and dwarven ingenuity, to eliminate foes from great distances. Even though he works alone he is steadfast in the protection of his home and has aligned himself with the Helbourne who are also enemies of the Dwarves. Meeting the Electrician and Dr. Repulsor cemented his belief that the only way for his people to survive in these changing times is through harnessing technology, and leaving the voodoo behind.","primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"},"232":{"hero_id":"232","disp_name":"Salomon","description":"The mighty Salomon has been summoned by Ophelia to serve as magical guardian of the Legion, and to grant the Hellbourne&#039;s Last Wish.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"233":{"hero_id":"233","disp_name":"Prisoner 945","description":"Prisoner 945 led the ground forces of the Titan Rebellion and was imprisoned by Jeraziah in the dungeons of The Capital. He is released in this desperate hour to battle the Hellbourne, but only his actions on the battlefield will finally free him from his chains.","primaryattribute":"Strength","attacktype":"melee","team":"Legion"},"234":{"hero_id":"234","disp_name":"Sir Benzington","description":"The beavrels are a proud species, fiercely protective of their territory. Dangerous enough with tooth and tail, they have adapted to the daemon threat by forming the Lancer Brotherhood, led by the fearless Sir Benzington upon his loyal fearet Balric. His righteous lance was crafted for one purpose: piercing the very heart of the Hellbourne.","primaryattribute":"Agility","attacktype":"melee","team":"Legion"},"235":{"hero_id":"235","disp_name":"Circe","description":"In ancient days it was the wanderers and adventurers who fell victim to the sorceress known as Circe the Deceiver, drawn to the island prison by her enchanted disguises of long-lost loved ones, missing sailors, even gods they worshipped and believed they had found. Circe&#039;s influence over Man has now lead her to the battlefield, aligned with the daemons to ensure the gods of Mankind would never regain their supreme power.","primaryattribute":"Intelligence","attacktype":"ranged","team":"Hellbourne"},"236":{"hero_id":"236","disp_name":"Klanx","description":null,"primaryattribute":"Agility","attacktype":"ranged","team":"Hellbourne"}}